app/views/visitors/index.html.erb

SELECT COUNT(*) FROM `products`
---
<h3>Welcome</h3>
<p><%= link_to 'Prduct:', products_path %> <%= Product.count %> registered</p>