app/controllers/products_controller.rb

INSERT INTO `products` (`image_title`, `image_desc`, `main_image`, `thumb_image`, `price`, `created_at`, `updated_at`, `type_id`) VALUES ('jkhougogy', 'jhbhjiygui', 'download__1_.jpeg', 'download__1_.jpeg', 231, '2021-10-07 12:29:05', '2021-10-07 12:29:05', 2)
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save