app/controllers/sessions_controller.rb

  def create
    @user_id = session[:otp_login]
    @user = User.find_by(id: @user_id)
    @otp = params[:user]["otp_attempt"]

    if @user.validate_and_consume_otp!(@otp)
      @user.otp_required_for_login = false
      @user.last_sign_in_at = Time.now
      @user.save
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
UPDATE `users` SET `sign_in_count` = 2, `current_sign_in_at` = '2021-10-07 10:35:23', `last_sign_in_at` = '2021-10-07 10:33:43', `updated_at` = '2021-10-07 10:35:23' WHERE `users`.`id` = 1