app/controllers/visitors_controller.rb

def getotp
   if @user = User.find_by(phone: params["phone"])
        @user.otp_required_for_login = true
        @user.otp_secret = User.generate_otp_secret
        @otp = @user.current_otp
        @user.save
---
SELECT  `users`.* FROM `users` WHERE `users`.`phone` = '09567449942' LIMIT 1
UPDATE `users` SET `encrypted_otp_secret` = 'CCLDuwwMjPtJa5sCyYvPKu2m/LshJzSPOCssAVcbDWQtBhH6beiFwQ==\n', `encrypted_otp_secret_iv` = 'QHWawMgxrjazGXl+\n', `encrypted_otp_secret_salt` = '_U4+xTmi8PNLPbBKOSBx2Qw==\n', `updated_at` = '2021-10-07 09:18:45' WHERE `users`.`id` = 2