app/views/products/_form.html.erb

   <%= f.label :Category %>
    <%= f.collection_select(:type_id, Type.all, :id, :title,
                              {
                                include_blank: true
                              },
                              class: 'form-control'
                            )
---
SELECT `types`.* FROM `types`